Repository: nonamez/dleToWp
Catalog: languages/dleToWp-*.po
Languages: ru_ru

source: Database converter
ru_ru: Конвертирование базы данных

source: Settings
ru_ru: Настройки

source: Database
ru_ru: База данных

source: Database prefix
ru_ru: Префикс базы

source: Version
ru_ru: Версия

source: Upload images
ru_ru: Загружать картинки

source: Resize images
ru_ru: Изменять размер изображения

source: Parse BB Codes
ru_ru: Парсить BB Коды

source: Split news
ru_ru: Разделять новости

source: Database not found.
ru_ru: База данных не найдена.

source: Required tables with the specified prefix is not found.
ru_ru: Обязательные таблицы с заданным префиксом не обнаружены.

source: Currently tested on version 8.5, in development are the following versions. Wait for updates.
ru_ru: В данный момент проверено на версии 8.5, разработка следующих версий в процессе. Ждите обновлений.

source: Uploads all images to Wordpress.
ru_ru: Загружает все картинки в Wordpress.

source: <strong>Important: </strong>it will take more time.
ru_ru: <strong>Внимание: </strong>это займет некоторое время.

source: Uploaded images will be resized by Wordpress.
ru_ru: Wordpress изменит размеры загружаемых изображений.

source: Splits each post. <strong>Important: </strong>it uses short post length and adds <em>&lt;!--more--&gt;</em> tag after it in full post
ru_ru: Разделяет каждую новость. <strong>Внимание: </strong>для разделение используется длина короткой новости и после неё в полной ставиться тег <em>&lt;!--more--&gt;</em>.

source: DLE Parser
ru_ru: DLE парсер

source: Simple Parser
ru_ru: Простой парсер

source: Parses BB codes to HTML entities.<br> <strong>Important: </strong><br> <span style="text-decoration: underline;">DLE Parser</span> method uses original DLE method, so i parses all codes, but leaves some extra stuff in HTML like <span style="text-decoration: underline;">&lt;!--TBegin--&gt</span> or <span style="text-decoration: underline;">&lt;!--dle_image_begin:http://.....</span><br> <span style="text-decoration: underline;">Simple Parser</span> method uses own small parser wich currently parses only <span style="text-decoration: underline;">b, i, u , s, quote, code, url, (left|center|right), font, size, color, PAGEBREAK</span> tags<br>
ru_ru: Преобразует BB коды в HTML сущности.<br><strong>Важно: </strong><br><span style="text-decoration: underline;">DLE Парсер</span> использует оригинальные метод DLE, поэтому преобразует абсолютно все сущности, но при этому оставляем дополнительый HTML мусор типа <span style="text-decoration: underline;">&lt;!--TBegin--&gt</span> или <span style="text-decoration: underline;">&lt;!--dle_image_begin:http://.…….</span><br><span style="text-decoration: underline;">Простой Парсер</span> использует собственный парсер который на данный момент парсит только <span style="text-decoration: underline;">b, i, u , s, quote, code, url, (left|center|right), font, size, color, PAGEBREAK</span><br>

source: You need to include parse class file from "DataLife Engine". Please copy "/engine/classes/parse.class.php" to this plugin directory.
ru_ru: Вам нужно добавить класс парсера текста. Для этого скопируйте файл "/engine/classes/parse.class.php" в директорию данного плагина.

source: Before starting transfer is highly recommended to do a full backup of the database in order to avoid any future problems. The author assumes no responsibility.
ru_ru: Перед началом переноса настоятельно рекомендуется сделать полную резервную копию базы данных во избежание каких-либо проблем. Автор не несет никакой ответственности.

source: Start transfer
ru_ru: Начать перенос

source: Stop transfer
ru_ru: Остановить перенос

source: Members transferred
ru_ru: Пользователей перенесено

source: Category transfer
ru_ru: Категорий перенесено

source: News transfer
ru_ru: Новостей перенесено

source: Comments transfer
ru_ru: Перенос коментариев
